numerator = [51, 15406, 25, 113, 1023, 362, 5054, 87, 6387, 953, 1720, 996, 372, 6450, 3569, 9079, 6162, 10197, 1796, 4071, 139, 161, 3948, 18570, 15258, 1542, 4301, 7670, 2461, 10142, 2139, 2140, 7089, 2450, 285, 60, 3731, 2660, 21706, 11, 490, 1722, 4437, 196, 100, 6, 112, 657, 2931, 1041, 509, 4297, 671, 1817, 347, 2237, 13369, 143, 27643, 11895, 1427, 2920, 28487]
denominator = [59, 19247, 583, 160, 3439, 717, 5917, 268, 14551, 1181, 2423, 1795, 1181, 23017, 4597, 11269, 7109, 11929, 2413, 5953, 857, 331, 10651, 23561, 32197, 3229, 5213, 10123, 2621, 15431, 15983, 8663, 7151, 7547, 2597, 521, 5581, 3817, 24017, 73, 521, 2287, 11147, 1279, 209, 77, 359, 721, 7291, 1357, 947, 9773, 4238, 1877, 721, 4499, 14461, 3763, 39689, 23603, 2453, 7757, 66317]


def compute_hcf(x, y):
    if x > y:
        smaller = y
    else:
        smaller = x
    for i in range(1, smaller + 1):
        if (x % i == 0) and (y % i == 0):
            hcf = i
    return hcf


def compute_lcm(x, y):
    if x > y:
        greater = x
    else:
        greater = y
    while True:
        if (greater % x == 0) and (greater % y == 0):
            lcm = greater
            break
        greater += 1
    return lcm


index = 0

while index < len(numerator):
    num1 = int(numerator[index])
    num2 = int(denominator[index])
    print('數字:', num1)
    print('數字:', num2)
    print("兩數的最大公因數是", compute_hcf(num1, num2))
    index += 1
